<!DOCTYPE html> <html> 	<head>
	     	<meta http-equiv="Content-Language" content="ES" />	 		
	     	<meta http-equiv="content-type" content="text/html"  charset="UTF-8" /> 	
	     		<title>&Aacute;lgebra Lineal I</title>
		
		
		<!-- Bootstrap core CSS -->
    <link href="../../vendor/bootstrap/css/bootstrap.min.css" rel="stylesheet">
     <!-- Stylesheets  -->
		<link  href="../../css/local.css" rel="stylesheet">		
	
		<body class="section-light"id="overall">
 		<h1 class="t">&Aacute;lgebra Lineal I</h1>
 		<strong>Instructor:</strong> <em>Rafael S. Gonz&aacute;lez D'Le&oacute;n</em><br>
 		<strong>Email:</strong> <em>gonzalezdrafael@javeriana.edu.co</em><br>
 		<strong>P&aacute;gina web:</strong> <em>http://dleon.combinatoria.co</em><br>
 		<strong>Horas de oficina:</strong> <em> Jueves 9:00 a 11:00 o por cita.<br>
 		

 		<div id="main">
 		
 			<h2>Clases</h2>
 			<span>Martes y Jueves 11:00 a 13:00 <br></span>
 			<h2>Literatura</h2>
 			<span><em>Linear Algebra and its applications.</em> D. C. Lay. Fourth edition.</span><br>
			<span><em>Introduction To Linear Algebra </em> Gilbert Strang. Fifth edition.</span><br>
 			<span><em>Linear algebra done right.  Springer.</em> S. Axler. Third edition.</span><br>
 			<span><em> Introduction to Linear Algebra.  Springer.</em> S. Lang. Second edition.</span><br>
 			<h2>Contenido del curso</h2>
 			<span>
        	El curso de Álgebra Lineal presenta los elementos y propiedades que constituyen y caracterizan los espacios vectoriales.
El curso introduce al estudiante en las operaciones que definen a un espacio vectorial, el &aacute;lgebra de vectores, matrices y sus propiedades, los sistemas de ecuaciones lineales y sus soluciones, el determinante y las transformaciones lineales.
Se presentan algunas aplicaciones del &aacute;lgebra lineal, vectores y valores propios, diagonalizaci&oacute;n de matrices y problemas de ortogonalidad y m&iacute;nimos cuadrados.</span>		
 			
			<h2>Distribuci&oacute;n de las notas</h2>
 			<h3>Parciales (75%)</h3>
 			<span>Habr&aacute; tres parciales de (25%) cada uno en las semanas 6, 11 y 17 de clases. Cada uno de estos parciales contar&aacute; con un componente sincr&oacute;nico 
 			y un componente asincr&oacute;nico. La fecha de estos parciales se revisar&aacute; con al menos una semana de anticipaci&oacute;n.</span>
 			
 			<h3>Tareas y talleres (25%)</h3>
 			<span>Se asignar&aacute;n dos tipos de tareas: 2 tareas de presentaci&oacute;n escrita en donde el estudiante ejercitar&aacute; las habilidades de razonamiento y escritura formal
 			en esta &aacute;rea de las matem&aacute;ticas. Cada una de estas tareas tendr&aacute; un valor del 5%. Las tareas deben ser subidas en la plataforma de clase en las fechas indicadas. 
 			Los compilados de tareas que est&eacute;n muy desordenados, sucios o ilegibles se les asignar&aacute; una nota de 0.0, as&iacute; que se le solicita a los estudiantes 
 			ser muy organizados con las entregas. Es responsabilidad de cada uno de los estudiantes de subir a la plataforma una versi&oacute;n de su 
         tarea que se adec&uacute;e a estos est&aacute;ndares. El otro 10% se asignar&aacute; en tareas de respuesta m&uacute;ltiple en la plataforma WebWork alrededor de cada 2 semanas.
         El link de la plataforma es <a href="http://webwork.grupolema.org/webwork2/JAVERIANA-ALGEBRA_LINEAL_I-GONZALEZ_D_LE/">http://webwork.grupolema.org/webwork2/JAVERIANA-ALGEBRA_LINEAL_I-GONZALEZ_D_LE/</a>. 
  
 			
 			
 			 Durante el semestre se asignar&aacute;n tambi&eacute;n problemas adicionales que los estudiantes ir&aacute;n desarrollando por su cuenta y por medio trabajo grupal en clase. 
 			 Se recomienda a los estudiantes trabajar en estos problemas de manera continua durante el semestre. 
    
         Trabajar en los problemas de tarea es fundamental para el entendimiento del material presentado en clase. Aseg&uacute;rese 
         de separar tiempo suficiente de cada semana para pensar y escribir sus soluciones. Se recomienda que le piense e intente 
         cada problema por su propia cuenta antes de buscar ayuda. Se invita a los estudiantes a que discutan el material del 
         curso con sus compa&ntilde;eros, sin embargo cada estudiante debe escribir sus propias soluciones y en sus propias palabras.
 			
 			</span>
 			
 			<h3>Sesiones de problemas</h3>
 		   <span>Habr&aacute; varias sesiones de problemas en clase durante el semestre con el objetivo de reforzar los conceptos aprendidos
 		   en cada semana. Durante las sesiones de problemas se invita a los estudiantes a que compartan lo que han aprendido y que 
 		   aprendan de sus compa&ntilde;eros de clase.<br></span>
 			
			<h2>Syllabus</h2>
			<span>Este es un programa aproximado del contenido del curso:</span>
			<table class="ui-widget ui-widget-content" cellpadding="0" cellspacing="0" border="1" align="center" width="95%" frame="border" rules="all">
				<thead align="center">
					<tr class="ui-widget-header "><th width="20%">Semana</th><th width="80%">Tema</th></tr>
				</thead>
				<tbody align="center">
				


					<tr><td>Semana 1</td><td>Introducción. Sistemas de ecuaciones lineales </td></tr>
					<tr><td>Semana 2</td><td>Eliminación Gausiana y formas escalonadas. Ecuaciones vectoriales y ecuaciones matriciales</td></tr>
					
					<tr><td>Semana 3</td><td>Solucion de sistemas de ecuaciones lineales</td></tr>
					
					<tr><td>Semana 4</td><td>Independencia Lineal. Transformaciones lineales. La matriz de una transformación lineal</td></tr>

					

					<tr><td>Semana 5</td><td>Operaciones matriciales. La inversa de una matriz</td></tr>

					
					<tr><td>Semana 6</td><td>Caracterizaciones de las matrices invertibles</td></tr>
					
					<tr><td>Semana 7</td><td>Repaso y Parcial 1 </td></tr>
					<tr><td>Semana 8</td><td>Determinantes y sus propiedades</td></tr>
					

					

					<tr><td>Semana 9</td><td>Espacios vectoriales y subespacios</td></tr>

					
					<tr><td>Semana 10</td><td>Espacios nulos, columna y transformaciones lineales</td></tr>
					<tr><td>Semana 11</td><td>Repaso y Parcial 2 </td></tr>
					<tr><td>Semana 12</td><td>Dimension y bases</td></tr>
								
					<tr><td>Semana 13</td><td>Sistemas de coordenadas y cambio de base</td></tr>
					
					<tr><td>Semana 14 </td><td>Aplicaciones a las cadenas de Markov y a los sistemas dinámicos discretos</td></tr>
					<tr><td>Semana 15</td><td>Valores y vectores propios. La ecuación característica</td></tr>
				
		
					<tr><td>Semana 16</td><td>Ortogonalidad y mínimos cuadrados</td></tr>
					
					<tr><td>Semana 17</td><td>Repaso y Parcial 3 </td></tr>
				
				</tbody>
			</table>			
		
			<h2>Cambios a este programa</h2>
			<span>Este programa podr&aacute; tener algunos cambios durante el semestre. Es responsabilidad del estudiante asistir a clase y visitar
			frecuentemente la p&aacute;gina web del curso para mantenerse actualizado sobre estos cambios. </span>
 		</div>
	</body>
</html>
