<!DOCTYPE html> <html> 	<head>
	     	<meta http-equiv="Content-Language" content="EN" />	 		<meta http-equiv="content-type" content="text/html; charset=UTF-8" /> 	
	     		<title>Combinatoria y teor&iacute;a de grafos</title>
		
		
		<!-- Bootstrap core CSS -->
    <link href="../../vendor/bootstrap/css/bootstrap.min.css" rel="stylesheet">
     <!-- Stylesheets  -->
		<link  href="../../css/local.css" rel="stylesheet">		
	
		<body>
 		<h1 class="t"> Combinatoria y teor&iacute;a de grafos</h1>
 		<strong>Instructor:</strong> <em>Rafael S. Gonz&aacute;lez D'Le&oacute;n</em><br>
 		<strong>Email:</strong> <em>rafael.gonzalezl@usa.edu.co</em><br>
 		<strong>Homepage:</strong> <a href="http://dleon.combinatoria.co">http://dleon.combinatoria.co</a><br>
 		<strong>Atenci&oacute;n a estudiantes:</strong> <em> Por cita programada.<br>
 		

 		<div id="main">
 			<h2>Clases</h2>
 			<span>Lunes 4:00-6:00 pm y viernes 6:00-8:00 pm. <br></span>
 			<h2>Literatura</h2>
 			<span><em>A First Course in Discrete Mathematics.</em> Ian Anderson.<br>
 			<em>Notas de clase (<a href="files/notas_de_clase_combinatoria.pdf"> en PDF</a>).</em></span>
 			<h2>Contenido del curso</h2>
 			<span>
        	La combinatoria es la rama de la matem&aacute;tica que se encarga de la enumeraci&oacute;n y estructura de familias 
        	de objetos discretos. Un grafo es un objeto discreto formado por un conjunto de nodos y un conjunto de 
        	aristas entre ellos.  La teor&iacute;a de grafos se encarga entonces de la enumeraci&oacute;n y el estudio de las 
        	propiedades estructurales de familias de grafos. Este es principalmente un curso introductorio a la teor&iacute;a 
        	de enumeraci&oacute;n combinatoria en donde usaremos la teor&iacute;a de grafos como campo de juego en donde usar 
        	herramientas combinatorias. Desde el punto de vista enumerativo se cubrir&aacute;n los principios b&aacute;sicos de conteo; 
        	permutaciones y n&uacute;meros factoriales; subconjuntos y coeficientes binomiales; composiciones y composiciones 
        	d&eacute;biles; particiones de conjuntos y n&uacute;meros de Stirling; n&uacute;meros de Fibonacci y n&uacute;meros de Catalan; 
        	recurrencias; funciones generatrices; y el principio de inclusi&oacute;n-exclusi&oacute;n (PIE). 
        	De la teor&iacute;a de grafos se cubrir&aacute;n las definiciones b&aacute;sicas de grafos; caminos, caminatas y ciclos; &aacute;rboles 
        	generadores o de expansi&oacute;n; grafos bipartitos; planaridad y el teorema de Kuratowski; grafos Hamiltonianos 
        	y Eulerianos.; poliedros; y coloraciones de grafos  y el polinomio crom&aacute;tico. 	</span>		
 			
 			<h2>Distribuci&oacute;n de las notas</h2>
 			<h3>Parciales (30%)</h3>
 			<span>Habr&aacute; dos parciales. La fecha de estos se avisar&aacute; con al menos una semana de anticipaci&oacute;n.</span>
 			<h3>Final (30%)</h3>
 			<span>Habr&aacute; un ex&aacute;men final sobre todo el contenido del programa por un valor del 30%.</span>
 			<h3>Tareas y quizzes (40%)</h3>
 			<span>Habr&aacute; conjuntos de problemas que se asignar&aacute;n aproximadamente cada semana y que deber&aacute;n ser entregados
 			a la semana siguiente. Trabajar en los problemas de tarea es fundamental para el entendimiento del material presentado en
 			clase. Aseg&uacute;rese de separar tiempo suficiente de cada semana para pensar y escribir sus soluciones.<em> Se recomienda que
 			le piense e intente cada problema por su propia cuenta antes de buscar ayuda</em>. Se invita a los estudiantes a que discutan
 			 el material del curso con sus compa&ntilde;eros, sin embargo cada estudiante debe escribir sus propias soluciones y en sus
 			 propias palabras. Pueden haber algunos quizzes que no ser&aacute;n anunciados y tambi&eacute;n contar&aacute;n hacia la nota
 			 final. La distribuci&oacute;n de las tareas seg&uacute;n los cortes ser&aacute; de 15% en el primer corte, 15% en el segundo
 			 corte, y 10% en el tercer corte.</span>
 			
 			<h3>Sesiones de problemas</h3>
 		   <span>Habr&aacute; varias sesiones de problemas en clase durante el semestre con el objetivo de reforzar los conceptos aprendidos
 		   en cada semana. Durante las sesiones de problemas se invita a los estudiantes a que compartan lo que han aprendido y que 
 		   aprendan de sus compa&ntilde;eros de clase.<br></span>
 			
 			<h3>Problemas sugeridos</h3>
 			<span>Habr&aacute; tambi&eacute;n algunos problemas sugeridos adicionales. Estos problemas ser&aacute; asignados en
 			algunas de las clases.<br></span>
			
			<h2>Programa</h2>
			<span>Este es un programa aproximado del contenido del curso:</span>
			<table class="ui-widget ui-widget-content" cellpadding="0" cellspacing="0" border="1" align="center" width="95%" frame="border" rules="all">
				<thead align="center">
					<tr class="ui-widget-header "><th width="20%">Fecha</th><th width="80%">Tema</th></tr>
				</thead>
				<tbody align="center">
				


					<tr><td>Lun 01/22</td><td>Introducci&oacute;n. &iquest;Qu&eacute; es la combinatoria? Repaso demostraciones matem&aacute;ticas.</td></tr>
					<tr><td>Vie 01/26</td><td>Principios b&aacute;sicos de conteo. Permutaciones y factoriales</td></tr>
					<tr><td>Lun 01/29</td><td>Combinaciones y selecciones</td></tr>
					<tr><td>Vie 02/02</td><td>Combinaciones y selecciones</td></tr>
					<tr><td>Lun 02/05</td><td>Coeficientes binomiales y el tri&aacute;ngulo de Pascal</td></tr>
					<tr><td>Vie 02/09</td><td>Selecciones con repeticiones y composiciones</td></tr>
					<tr><td>Lun 02/12</td><td>Selecciones con repeticiones y composiciones</td></tr>
					<tr><td>Vie 02/16</td><td>Un teorema de inversi&oacute;n matricial</td></tr>
					<tr><td>Lun 02/19</td><td>Recurrencias</td></tr>
					<tr><td>Vie 02/23</td><td>M&eacute;todo de la ecuaci&oacute;n auxiliar</td></tr>
					<tr><td>Lun 02/26</td><td>M&eacute;todo de la ecuaci&oacute;n auxiliar</td></tr>
					
					<tr><td>Vie 03/02</td><td>Primer Parcial</td></tr>
					<tr><td>Lun 03/05</td><td>Funciones generatrices</td></tr>
					<tr><td>Vie 03/09</td><td>Funciones generatrices</td></tr>
					
					<tr><td>Lun 03/12</td><td>Desarreglos. Algoritmos de ordenamiento</td></tr>
					<tr><td>Vie 03/16</td><td>N&uacute;meros de Catalan</td></tr>
					<tr><td>Vie 03/23</td><td>Grafos</td></tr>
					
					<tr><td>Lun 04/02</td><td>Caminos y &aacute;rboles</td></tr>
					<tr><td>Vie 04/06</td><td>&Aacute;rboles de expansi&oacute;n</td></tr>
					<tr><td>Lun 04/09</td><td>&Aacute;rboles de expansi&oacute;n</td></tr>
					
					<tr><td>Vie 04/13</td><td>Grafos bipartitos. Planaridad</td></tr>
					<tr><td>Lun 04/16</td><td>Poliedros</td></tr>
					<tr><td>Vie 04/20</td><td>Segundo Parcial</td></tr>
					
					<tr><td>Lun 04/23</td><td>Grafos Hamiltonianos</td></tr>
					<tr><td>Vie 04/27</td><td>Problema del agente viajero</td></tr>
					<tr><td>Lun 04/30</td><td>Grafos Eulerianos</td></tr>
					
					<tr><td>Vie 05/04</td><td>Particiones</td></tr>
					<tr><td>Lun 05/07</td><td>Particiones</td></tr>
					<tr><td>Vie 05/11</td><td>Coloraciones de grafos y el polinomio crom&aacute;tico</td></tr>
					
					<tr><td>Vie 05/18</td><td>Principio de Inclusi&oacute;n-Exclusi&oacute;n (PIE)</td></tr>
				
				</tbody>
			</table>
			
			<h2>Pol&iacute;tica sobre calculadoras</h2>
			<span>Calculadoras no ser&aacute;n permitidas en quizzes, parciales o ex&aacute;men final.</span>
				
			<h2>C&oacute;digo of conducta</h2>
			<span>Los estudiantes deben consultar los derechos y deb&eacute;res del estudiante en el
			<a href="http://www.usergioarboleda.edu.co/institucional/#reglamento_estudiantil">Reglamento estudiantil.</a>
			Cualquier ofensa a los lineamientos dispuestos por la universidad iniciar&aacute; los procedimientos disciplinarios establecidos.</span>
		
			<h2>Cambios a este programa</h2>
			<span>Este programa podr&aacute; tener algunos cambios durante el semestre. Es responsabilidad del estudiante asistir a clase y visitar
			frecuentemente la p&aacute;gina web del curso para mantenerse actualizado sobre estos cambios. </span>
			 
 		</div>
	</body>
</html>
